In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [4]:
movies=pd.read_csv("C:\\Users\\Gayatri\\Documents\\da project\\Movies\\movie.csv", encoding='ISO-8859-1')
movies.head()

   Movie_ID                           Title  Year  Rating  Number_of_Ratings
0         1  The Nightmare Before Christmas  1993     3.9             4568.0
1         2                       The Mummy  1932     3.5             4388.0
2         3            Orphans of the Storm  1921     3.2             9062.0
3         4            The Object of Beauty  1991     2.8             6150.0
4         5                      Night Tide  1963     2.8             5126.0

# The number of movies released between 1950 and 1960.

In [5]:
movies_df=movies[(movies['Year']>1950) & (movies['Year']<1960)]
result=movies_df[['Title','Year']]
result

                                                   Title  Year
93                                 House on Haunted Hill  1959
97                        Godzilla: King of the Monsters  1956
99                                             High Noon  1952
315                             Beneath the 12-Mile Reef  1953
401                      Love Is a Many-Splendored Thing  1955
...                                                  ...   ...
35627  Alfred Hitchcock Presents: Season 3: The Canar...  1957
35634  Alfred Hitchcock Presents: Season 3: Impromptu...  1957
44640                              Isn't Life Wonderful!  1954
44722  Disney Animation Collection: Vol. 4: The Torto...  1958
44766  Disney Animation Collection: Vol. 2: Three Lit...  1952

[414 rows x 2 columns]

# The number of movies having rating more than 4.

In [6]:
rating=movies[movies['Rating']>4].reset_index()
print(rating[['Title','Rating']])

                                                 Title  Rating
0                                         Pulp Fiction     4.1
1                                    Life Is Beautiful     4.2
2                               Mulan: Special Edition     4.2
3                                         Forrest Gump     4.3
4                                           Braveheart     4.2
..                                                 ...     ...
892                           Life With Boys: Season 1     4.1
893                                          Max Steel     4.1
894                       Lilyhammer: Season 1 (Recap)     4.2
895                           The Short Game (Trailer)     4.1
896  Transformers Prime Beast Hunters: Predacons Ri...     4.2

[897 rows x 2 columns]

#  The movies whose rating are between 3 and 4

In [7]:
rating_between_3and4=movies[(movies['Rating']>3) & (movies['Rating']<4)]
print(rating_between_3and4[["Title","Rating"]])

                                                  Title  Rating
0                        The Nightmare Before Christmas     3.9
1                                             The Mummy     3.5
2                                  Orphans of the Storm     3.2
5                                   One Magic Christmas     3.8
6                                      Muriel's Wedding     3.5
...                                                 ...     ...
49575                       Dave Foley: Relatively Well     3.2
49579             Underground: The Julian Assange Story     3.7
49580           Curious George: A Very Monkey Christmas     3.8
49582  Lady Gaga &#38; The Muppets' Holiday Spectacular     3.1
49584                                      Silver Bells     3.5

[7161 rows x 2 columns]

# The number of movies with duration more than 2 hours.

In [8]:
duration=movies[movies['Number_of_Ratings']>7200]
print(duration[['Title','Number_of_Ratings']])

                                                   Title  Number_of_Ratings
2                                   Orphans of the Storm             9062.0
12                                 The Birth of a Nation            12118.0
13                                  The Boys from Brazil             7417.0
20                            Born on the Fourth of July             8646.0
21                                        Broadcast News             7940.0
...                                                  ...                ...
45107                                             Settai             7390.0
46831  WWE for All Mankind: The Life &#38; Career of ...             8066.0
46948                     Example Short XII 23976 2 Hour             7370.0
48713     WWE: The Top 25 Rivalries in Wrestling History            10228.0
49054                       Theeya Velai Seyyanum Kumaru             8239.0

[641 rows x 2 columns]

# The list of years and number of movies released each year.

In [9]:
movies.columns

Index(['Movie_ID', 'Title', 'Year', 'Rating', 'Number_of_Ratings'], dtype='object')

In [10]:
movies_released_in_each_year=movies.groupby('Year')['Title'].size().reset_index(name='Total movies')
movies_released_in_each_year

     Year  Total movies
0    1913             3
1    1914            20
2    1915             1
3    1916             1
4    1918             1
..    ...           ...
96   2010          5107
97   2011          5511
98   2012          4339
99   2013           981
100  2014             1

[101 rows x 2 columns]

# Total number of movies in dataset .

In [11]:
Total_movies=movies['Movie_ID'].size
print("Total movies in dataset:",Total_movies)

Total movies in dataset: 49590

# 10 oldest films in the collection.

In [12]:
oldest_films=movies.sort_values(by='Year').head(10).reset_index()
print(oldest_films[['Title','Year']])

                                               Title  Year
0                     Fantômas II: Juve vs. Fantômas  1913
1        Fantômas I: In the Shadow of the Guillotine  1913
2                 Fantômas III: The Murderous Corpse  1913
3                   Fantômas V: The False Magistrate  1914
4                                            Cabiria  1914
5  Charlie Chaplin Collection: Shorts: The Rink  ...  1914
6                 Charlie Chaplin Collection: Shorts  1914
7  Charlie Chaplin Collection: Shorts: The Count ...  1914
8  Charlie Chaplin Collection: Shorts: The Firema...  1914
9  Charlie Chaplin Collection: Shorts: The Tramp ...  1914

# Total number of films released per year

In [13]:
films_per_year=movies['Year'].value_counts().reset_index(name='Films counts')
films_per_year

     Year  Films counts
0    2011          5511
1    2010          5107
2    2009          4451
3    2012          4339
4    2008          3358
..    ...           ...
96   1921             2
97   1915             1
98   1916             1
99   1918             1
100  2014             1

[101 rows x 2 columns]

# The average rating for films grouped by decade.

In [14]:
Avg_rating=movies.groupby((movies['Year']//10)*10)['Rating'].mean().reset_index()
Avg_rating

    Year    Rating
0   1910  2.878571
1   1920  3.164865
2   1930  3.228205
3   1940  3.368831
4   1950  3.245000
5   1960  3.200490
6   1970  3.255191
7   1980  3.347173
8   1990  3.429654
9   2000  3.443407
10  2010  3.529766

# Count the number of movies within certain rating ranges.

In [15]:
bins = [0, 2, 4, 5, 10]  
labels = ['0-2', '2-4', '4-5', '5-10']
movies['Rating_Range'] = pd.cut(movies['Rating'], bins=bins, labels=labels, right=False)
rating_counts = movies['Rating_Range'].value_counts().sort_index().reset_index(name='movies')
print(rating_counts)

  Rating_Range  movies
0          0-2      81
1          2-4    9256
2          4-5    1477
3         5-10       0

# The movie having the same name but released in different years.

In [16]:
movies.columns

Index(['Movie_ID', 'Title', 'Year', 'Rating', 'Number_of_Ratings',
       'Rating_Range'],
      dtype='object')

In [17]:
same_name_movie=movies['Title'].value_counts().reset_index
same_name_movie

<bound method Series.reset_index of Title
Bleak House                                                    4
Treasure Island                                                3
Mansfield Park                                                 3
Jane Eyre                                                      3
Kidnapped                                                      3
                                                              ..
The Andy Griffith Show: Season 7: Goober Makes History         1
The Andy Griffith Show: Season 7: The Ballgame                 1
The Andy Griffith Show: Season 7: Aunt Bee's Crowning Glory    1
The Andy Griffith Show: Season 7: Helen  the Authoress         1
Kate Plus Ei8ht: Season 1                                      1
Name: count, Length: 49143, dtype: int64>

# The movies that have a duration of less than one hour.

In [18]:
one_hour_duration=movies[movies['Number_of_Ratings']<3600].reset_index()
print(one_hour_duration[['Title','Number_of_Ratings']])

                                                   Title  Number_of_Ratings
0                                              Elvis '56             3518.0
1                                    Steamboat Bill  Jr.             3378.0
2                                     Ring of Fire: IMAX             2280.0
3                              Tropical Rainforest: IMAX             2284.0
4                              Barney: Let's Play School             2942.0
...                                                  ...                ...
38072  Barbie: Life in the Dreamhouse: Barbie Life in...             1458.0
38073            Curious George: A Very Monkey Christmas             3438.0
38074                           Mumfie's White Christmas             1350.0
38075   Lady Gaga &#38; The Muppets' Holiday Spectacular             3496.0
38076                                  Winter Wonderland             1812.0

[38077 rows x 2 columns]

# The longest and shortest movies for every year.

In [19]:
max_rating=movies.groupby('Year')['Number_of_Ratings'].max().reset_index(name='Max_rating')
longest_movie = pd.merge(max_rating, movies,left_on=['Year','Max_rating'],right_on=['Year', 'Number_of_Ratings'])
longest_movie = longest_movie[['Year', 'Title', 'Number_of_Ratings']]
print(longest_movie)

     Year                                              Title  \
0    1913                 Fantômas III: The Murderous Corpse
1    1914                                            Cabiria
2    1915                              The Birth of a Nation
3    1916                                        Intolerance
4    1918                           I Don't Want To Be A Man
..    ...                                                ...
97   2010               Example 8 Hour 23.976 Remote Content
98   2011         Ancient Astronauts: The Gods from Planet X
99   2012  WWE: The Best of Raw &#38; SmackDown 2012: Vol. 3
100  2013     WWE: The Top 25 Rivalries in Wrestling History
101  2014                               The Square (Trailer)

     Number_of_Ratings
0               5432.0
1               7684.0
2              12118.0
3              11873.0
4               2692.0
..                 ...
97             28813.0
98             11465.0
99             10664.0
100            10228.0
101              154.0

[102 rows x 3 columns]

In [20]:
min_rating=movies.groupby('Year')['Number_of_Ratings'].min().reset_index(name='Min_rating')
shortest_movie = pd.merge(min_rating, movies,left_on=['Year','Min_rating'],right_on=['Year', 'Number_of_Ratings'])
shortest_movie = shortest_movie[['Year', 'Title', 'Number_of_Ratings']]
print(shortest_movie)

     Year                                              Title  \
0    1913        Fantômas I: In the Shadow of the Guillotine
1    1914  Charlie Chaplin Collection: Shorts: By the Sea...
2    1915                              The Birth of a Nation
3    1916                                        Intolerance
4    1918                           I Don't Want To Be A Man
..    ...                                                ...
100  2010  TEDTalks: Inexplicable Connections: Derek Sive...
101  2011  TEDTalks: Crime &#38; Punishment: Damon Horowi...
102  2012                                      Trailer: Pain
103  2013                                   Trailer: Emperor
104  2014                               The Square (Trailer)

     Number_of_Ratings
0               3268.0
1               2610.0
2              12118.0
3              11873.0
4               2692.0
..                 ...
100              157.0
101              226.0
102               52.0
103               67.0
104              154.0

[105 rows x 3 columns]

# The years that had the highest number of movies with ratings of 4 or higher.

In [21]:
High_rating=movies[movies['Rating']>=4]
movies_df=High_rating.groupby('Year').size().reset_index(name='Count')
movies_df

    Year  Count
0   1944      1
1   1951      2
2   1953      2
3   1954      1
4   1956      1
5   1957      1
6   1958      1
7   1959      1
8   1960      2
9   1961      1
10  1962      2
11  1963      4
12  1964      3
13  1965      1
14  1966      1
15  1967      1
16  1968      1
17  1969      1
18  1970      2
19  1971      1
20  1972      1
21  1973      3
22  1975      2
23  1977      2
24  1978      5
25  1979      2
26  1980      1
27  1982      2
28  1983      2
29  1984      1
30  1985      2
31  1986      2
32  1987      5
33  1988      7
34  1989      9
35  1990     16
36  1991      3
37  1992      9
38  1993      6
39  1994      7
40  1995      8
41  1996     10
42  1997     10
43  1998     11
44  1999     25
45  2000     13
46  2001     22
47  2002     20
48  2003     24
49  2004     29
50  2005     47
51  2006     62
52  2007     85
53  2008     92
54  2009    129
55  2010    202
56  2011    253
57  2012    252
58  2013     66

In [22]:
movies.columns

Index(['Movie_ID', 'Title', 'Year', 'Rating', 'Number_of_Ratings',
       'Rating_Range'],
      dtype='object')

In [23]:
pip install mysql-connector-python pandas

Requirement already satisfied: mysql-connector-python in c:\users\gayatri\anaconda3\lib\site-packages (9.0.0)
Requirement already satisfied: pandas in c:\users\gayatri\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\gayatri\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\gayatri\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\gayatri\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\gayatri\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\gayatri\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [28]:
import mysql.connector
from sqlalchemy import create_engine
db_config = {
    'user': 'root',
    'password': 'pass123',
    'host': 'localhost',
}
conn = mysql.connector.connect(**db_config)
cursor = conn.cursor()
cursor.execute("CREATE DATABASE IF NOT EXISTS movie")
cursor.close()
conn.close()

In [29]:
db_config['database'] = 'movie'
conn = mysql.connector.connect(**db_config)
cursor = conn.cursor()
query = """
CREATE TABLE IF NOT EXISTS movie (
    id INT AUTO_INCREMENT PRIMARY KEY,
    Movie_ID int,
    Title VARCHAR(100),
    Year year,
    Rating float,
    Number_of_Ratings float,
)
"""
cursor.execute(query)
cursor.close()

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ')' at line 8

In [30]:
engine = create_engine(f"mysql+mysqlconnector://{db_config['user']}:{db_config['password']}@{db_config['host']}/{db_config['database']}")
movies.to_sql('movie', con=engine, if_exists='replace', index=False)
print("Data imported successfully!")
conn.close()

Data imported successfully!